Revit.Elements.DimensionType
Dimension Type element.

Revit.Elements.DimensionType.InternalRevitElement
Internal reference to the Revit Element

Revit.Elements.DimensionType.InternalElement
Reference to the Element

Revit.Elements.DimensionType.InternalSetElement(Autodesk.Revit.DB.DimensionType)
Set the internal Element, ElementId, and UniqueId
element:

Revit.Elements.DimensionType.#ctor(Autodesk.Revit.DB.DimensionType)
DimensionType from existing
element:

Revit.Elements.DimensionType.#ctor(Autodesk.Revit.DB.DimensionType,System.String)
DimensionType by duplicating existing.
dimType:
name:

Revit.Elements.DimensionType.FromExisting(Revit.Elements.Element,System.String)
Creates new Dimension Type by duplicating an existing.
dimensionType: Dimension Type to duplicate.
name: New name that will be assigned to Dimension Type.
Returns:

Revit.Elements.DimensionType.StyleType
Returns Dimension Style for a givent type.

Revit.Elements.DimensionType.FromExisting(Autodesk.Revit.DB.DimensionType,System.Boolean)
From existing element
instance:
isRevitOwned:
Returns: